tugas 10/benchmark_async_lb/test_result_1.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        myserver/1.0
Server Hostname:        127.0.0.1
Server Port:            44444

Document Path:          /
Document Length:        4 bytes

Concurrency Level:      1
Time taken for tests:   4.554 seconds
Complete requests:      1000
Failed requests:        0
Non-2xx responses:      1000
Total transferred:      122000 bytes
HTML transferred:       4000 bytes
Requests per second:    219.61 [#/sec] (mean)
Time per request:       4.554 [ms] (mean)
Time per request:       4.554 [ms] (mean, across all concurrent requests)
Transfer rate:          26.16 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     2    4   2.8      3      32
Waiting:        2    4   2.7      3      31
Total:          2    4   2.9      3      33

Percentage of the requests served within a certain time (ms)
  50%      3
  66%      4
  75%      5
  80%      5
  90%      7
  95%      9
  98%     14
  99%     17
 100%     33 (longest request)