tugas 10/benchmark_async_lb/test_result_100.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        myserver/1.0
Server Hostname:        127.0.0.1
Server Port:            44444

Document Path:          /
Document Length:        4 bytes

Concurrency Level:      100
Time taken for tests:   2.947 seconds
Complete requests:      1000
Failed requests:        0
Non-2xx responses:      1000
Total transferred:      122000 bytes
HTML transferred:       4000 bytes
Requests per second:    339.29 [#/sec] (mean)
Time per request:       294.732 [ms] (mean)
Time per request:       2.947 [ms] (mean, across all concurrent requests)
Transfer rate:          40.42 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    4  10.8      0      54
Processing:    18  279  88.0    276     468
Waiting:       16  276  87.5    273     466
Total:         71  283  81.0    276     469

Percentage of the requests served within a certain time (ms)
  50%    276
  66%    321
  75%    343
  80%    352
  90%    379
  95%    421
  98%    461
  99%    466
 100%    469 (longest request)