tugas 10/benchmark_async_lb/test_result_50.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        myserver/1.0
Server Hostname:        127.0.0.1
Server Port:            44444

Document Path:          /
Document Length:        4 bytes

Concurrency Level:      50
Time taken for tests:   2.743 seconds
Complete requests:      1000
Failed requests:        0
Non-2xx responses:      1000
Total transferred:      122000 bytes
HTML transferred:       4000 bytes
Requests per second:    364.55 [#/sec] (mean)
Time per request:       137.157 [ms] (mean)
Time per request:       2.743 [ms] (mean, across all concurrent requests)
Transfer rate:          43.43 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   5.1      0      39
Processing:    26  132  32.7    123     215
Waiting:       19  130  32.6    121     212
Total:         64  134  32.0    124     223

Percentage of the requests served within a certain time (ms)
  50%    124
  66%    130
  75%    140
  80%    169
  90%    192
  95%    204
  98%    211
  99%    214
 100%    223 (longest request)